; domain
(define (domain rover)
(:requirements :typing)
(:types 	rover waypoint store camera mode lander objective - object
)

(:predicates (at ?x - rover ?y - waypoint)
	(at_lander ?x - lander ?y - waypoint)
	(can_traverse ?r - rover ?x - waypoint ?y - waypoint)
	(equipped_for_soil_analysis ?r - rover)
	(equipped_for_rock_analysis ?r - rover)
	(equipped_for_imaging ?r - rover)
	(empty ?s - store)
	(have_rock_analysis ?r - rover ?w - waypoint)
	(have_soil_analysis ?r - rover ?w - waypoint)
	(full ?s - store)
	(calibrated ?c - camera ?r - rover)
	(supports ?c - camera ?m - mode)
	(available ?r - rover)
	(visible ?w - waypoint ?p - waypoint)
	(have_image ?r - rover ?o - objective ?m - mode)
	(communicated_soil_data ?w - waypoint)
	(communicated_rock_data ?w - waypoint)
	(communicated_image_data ?o - objective ?m - mode)
	(at_soil_sample ?w - waypoint)
	(at_rock_sample ?w - waypoint)
	(visible_from ?o - objective ?w - waypoint)
	(store_of ?s - store ?r - rover)
	(calibration_target ?i - camera ?o - objective)
	(on_board ?i - camera ?r - rover)
	(channel_free ?l - lander)
)

(:action navigate
	:parameters   (?x - rover ?y - waypoint ?z - waypoint)
	:precondition (and (visible ?y ?z) (can_traverse ?x ?y ?z) (available ?x) (at ?x ?y))
	:effect       (and (at ?x ?z) (not (at ?x ?y))
))

(:action sample_soil
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (equipped_for_soil_analysis ?x) (at ?x ?p) (empty ?s) (at_soil_sample ?p))
	:effect       (and (have_soil_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_soil_sample ?p))
))

(:action sample_rock
	:parameters   (?x - rover ?s - store ?p - waypoint)
	:precondition (and (store_of ?s ?x) (at ?x ?p) (empty ?s) (equipped_for_rock_analysis ?x) (at_rock_sample ?p))
	:effect       (and (have_rock_analysis ?x ?p) (full ?s) (not (empty ?s)) (not (at_rock_sample ?p))
))

(:action drop
	:parameters   (?x - rover ?y - store)
	:precondition (and (store_of ?y ?x) (full ?y))
	:effect       (and (empty ?y) (not (full ?y))
))

(:action calibrate
	:parameters   (?r - rover ?i - camera ?t - objective ?w - waypoint)
	:precondition (and (calibration_target ?i ?t) (visible_from ?t ?w) (on_board ?i ?r) (equipped_for_imaging ?r) (at ?r ?w))
	:effect       (and (calibrated ?i ?r)
))

(:action take_image
	:parameters   (?r - rover ?p - waypoint ?o - objective ?i - camera ?m - mode)
	:precondition (and (at ?r ?p) (supports ?i ?m) (on_board ?i ?r) (equipped_for_imaging ?r) (calibrated ?i ?r) (visible_from ?o ?p))
	:effect       (and (have_image ?r ?o ?m) (not (calibrated ?i ?r))
))

(:action communicate_soil_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_soil_analysis ?r ?p) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_soil_data ?p)
))

(:action communicate_rock_data
	:parameters   (?r - rover ?l - lander ?p - waypoint ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (channel_free ?l) (visible ?x ?y) (have_rock_analysis ?r ?p) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_rock_data ?p)
))

(:action communicate_image_data
	:parameters   (?r - rover ?l - lander ?o - objective ?m - mode ?x - waypoint ?y - waypoint)
	:precondition (and (available ?r) (have_image ?r ?o ?m) (channel_free ?l) (visible ?x ?y) (at ?r ?x) (at_lander ?l ?y))
	:effect       (and (communicated_image_data ?o ?m)
))
)

; problem
(define (problem prb-265_d20_p-TR3-n32-r1w10o7c9-3) (:domain Rover)
(:objects
	general - Lander
	colour high_res low_res - Mode
	rover0 - Rover
	rover0store - Store
	waypoint0 waypoint1 waypoint2 waypoint3 waypoint4 waypoint5 waypoint6 waypoint7 waypoint8 waypoint9 - Waypoint
	camera0 camera1 camera2 camera3 camera4 camera5 camera6 camera7 camera8 - Camera
	objective0 objective1 objective2 objective3 objective4 objective5 objective6 - Objective
	)
(:init
(visible waypoint0 waypoint1)
(visible waypoint1 waypoint0)
(visible waypoint0 waypoint2)
(visible waypoint2 waypoint0)
(visible waypoint0 waypoint4)
(visible waypoint4 waypoint0)
(visible waypoint0 waypoint5)
(visible waypoint5 waypoint0)
(visible waypoint0 waypoint8)
(visible waypoint8 waypoint0)
(visible waypoint1 waypoint3)
(visible waypoint3 waypoint1)
(visible waypoint1 waypoint6)
(visible waypoint6 waypoint1)
(visible waypoint1 waypoint8)
(visible waypoint8 waypoint1)
(visible waypoint2 waypoint1)
(visible waypoint1 waypoint2)
(visible waypoint2 waypoint3)
(visible waypoint3 waypoint2)
(visible waypoint2 waypoint7)
(visible waypoint7 waypoint2)
(visible waypoint3 waypoint0)
(visible waypoint0 waypoint3)
(visible waypoint3 waypoint4)
(visible waypoint4 waypoint3)
(visible waypoint3 waypoint7)
(visible waypoint7 waypoint3)
(visible waypoint4 waypoint6)
(visible waypoint6 waypoint4)
(visible waypoint4 waypoint8)
(visible waypoint8 waypoint4)
(visible waypoint5 waypoint2)
(visible waypoint2 waypoint5)
(visible waypoint5 waypoint3)
(visible waypoint3 waypoint5)
(visible waypoint5 waypoint7)
(visible waypoint7 waypoint5)
(visible waypoint5 waypoint8)
(visible waypoint8 waypoint5)
(visible waypoint6 waypoint5)
(visible waypoint5 waypoint6)
(visible waypoint7 waypoint6)
(visible waypoint6 waypoint7)
(visible waypoint7 waypoint9)
(visible waypoint9 waypoint7)
(visible waypoint8 waypoint2)
(visible waypoint2 waypoint8)
(visible waypoint8 waypoint6)
(visible waypoint6 waypoint8)
(visible waypoint9 waypoint1)
(visible waypoint1 waypoint9)
(visible waypoint9 waypoint8)
(visible waypoint8 waypoint9)
(at_lander general waypoint3)
(store_of rover0store rover0)
(equipped_for_soil_analysis rover0)
(equipped_for_rock_analysis rover0)
(equipped_for_imaging rover0)
(can_traverse rover0 waypoint3 waypoint0)
(can_traverse rover0 waypoint0 waypoint3)
(can_traverse rover0 waypoint3 waypoint1)
(can_traverse rover0 waypoint1 waypoint3)
(can_traverse rover0 waypoint3 waypoint4)
(can_traverse rover0 waypoint4 waypoint3)
(can_traverse rover0 waypoint3 waypoint7)
(can_traverse rover0 waypoint7 waypoint3)
(can_traverse rover0 waypoint0 waypoint2)
(can_traverse rover0 waypoint2 waypoint0)
(can_traverse rover0 waypoint0 waypoint5)
(can_traverse rover0 waypoint5 waypoint0)
(can_traverse rover0 waypoint0 waypoint8)
(can_traverse rover0 waypoint8 waypoint0)
(can_traverse rover0 waypoint7 waypoint6)
(can_traverse rover0 waypoint6 waypoint7)
(can_traverse rover0 waypoint7 waypoint9)
(can_traverse rover0 waypoint9 waypoint7)
(on_board camera0 rover0)
(calibration_target camera0 objective5)
(supports camera0 colour)
(supports camera0 high_res)
(supports camera0 low_res)
(on_board camera1 rover0)
(calibration_target camera1 objective2)
(supports camera1 high_res)
(on_board camera2 rover0)
(calibration_target camera2 objective5)
(supports camera2 colour)
(on_board camera3 rover0)
(calibration_target camera3 objective4)
(supports camera3 colour)
(on_board camera4 rover0)
(calibration_target camera4 objective0)
(supports camera4 high_res)
(on_board camera5 rover0)
(calibration_target camera5 objective4)
(supports camera5 colour)
(supports camera5 high_res)
(on_board camera6 rover0)
(calibration_target camera6 objective6)
(supports camera6 high_res)
(supports camera6 low_res)
(on_board camera7 rover0)
(calibration_target camera7 objective0)
(supports camera7 colour)
(on_board camera8 rover0)
(calibration_target camera8 objective5)
(supports camera8 colour)
(supports camera8 high_res)
(supports camera8 low_res)
(visible_from objective0 waypoint0)
(visible_from objective0 waypoint4)
(visible_from objective0 waypoint5)
(visible_from objective0 waypoint6)
(visible_from objective0 waypoint7)
(visible_from objective0 waypoint9)
(visible_from objective1 waypoint4)
(visible_from objective2 waypoint2)
(visible_from objective2 waypoint3)
(visible_from objective2 waypoint6)
(visible_from objective3 waypoint1)
(visible_from objective3 waypoint2)
(visible_from objective3 waypoint3)
(visible_from objective3 waypoint8)
(visible_from objective4 waypoint0)
(visible_from objective4 waypoint9)
(visible_from objective5 waypoint7)
(visible_from objective6 waypoint0)
(visible_from objective6 waypoint2)
(visible_from objective6 waypoint6)
(at_rock_sample waypoint1)
(channel_free general)
(available rover0)
(empty rover0store)
(communicated_soil_data waypoint7)
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint5)
(communicated_soil_data waypoint6)
(communicated_rock_data waypoint5)
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint8)
(communicated_image_data objective0 high_res)
(have_soil_analysis rover0 waypoint3)
(at rover0 waypoint9)
(have_soil_analysis rover0 waypoint7)
(calibrated camera8 rover0)
(have_image rover0 objective0 high_res)
(have_rock_analysis rover0 waypoint0)
(have_soil_analysis rover0 waypoint5)
(have_rock_analysis rover0 waypoint5)
(have_rock_analysis rover0 waypoint8)
(have_soil_analysis rover0 waypoint6)
(have_soil_analysis rover0 waypoint9)
)

(:goal (and
(communicated_soil_data waypoint7)
(communicated_soil_data waypoint3)
(communicated_soil_data waypoint5)
(communicated_soil_data waypoint9)
(communicated_soil_data waypoint6)
(communicated_rock_data waypoint1)
(communicated_rock_data waypoint5)
(communicated_rock_data waypoint0)
(communicated_rock_data waypoint8)
(communicated_image_data objective4 colour)
(communicated_image_data objective2 low_res)
(communicated_image_data objective0 high_res)
(communicated_image_data objective6 high_res)
	)
)
)

; plan
1. (navigate rover0 waypoint9 waypoint7)
   deleted: (at rover0 waypoint9)
   added: (at rover0 waypoint7)
   goals met: 8 of 13
2. (navigate rover0 waypoint7 waypoint3)
   deleted: (at rover0 waypoint7)
   added: (at rover0 waypoint3)
   goals met: 8 of 13
3. (navigate rover0 waypoint3 waypoint0)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint0)
   goals met: 8 of 13
4. (communicate_soil_data rover0 general waypoint9 waypoint0 waypoint3)
   added: (communicated_soil_data waypoint9)
   goals met: 9 of 13
5. (navigate rover0 waypoint0 waypoint3)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint3)
   goals met: 9 of 13
6. (navigate rover0 waypoint3 waypoint1)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint1)
   goals met: 9 of 13
7. (sample_rock rover0 rover0store waypoint1)
   deleted: (empty rover0store) (at_rock_sample waypoint1)
   added: (have_rock_analysis rover0 waypoint1) (full rover0store)
   goals met: 9 of 13
8. (communicate_rock_data rover0 general waypoint1 waypoint1 waypoint3)
   added: (communicated_rock_data waypoint1)
   goals met: 10 of 13
9. (navigate rover0 waypoint1 waypoint3)
   deleted: (at rover0 waypoint1)
   added: (at rover0 waypoint3)
   goals met: 10 of 13
10. (navigate rover0 waypoint3 waypoint0)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint0)
   goals met: 10 of 13
11. (take_image rover0 waypoint0 objective4 camera8 colour)
   deleted: (calibrated camera8 rover0)
   added: (have_image rover0 objective4 colour)
   goals met: 10 of 13
12. (calibrate rover0 camera6 objective6 waypoint0)
   added: (calibrated camera6 rover0)
   goals met: 10 of 13
13. (communicate_image_data rover0 general objective4 colour waypoint0 waypoint3)
   added: (communicated_image_data objective4 colour)
   goals met: 11 of 13
14. (take_image rover0 waypoint0 objective6 camera6 high_res)
   deleted: (calibrated camera6 rover0)
   added: (have_image rover0 objective6 high_res)
   goals met: 11 of 13
15. (calibrate rover0 camera6 objective6 waypoint0)
   added: (calibrated camera6 rover0)
   goals met: 11 of 13
16. (communicate_image_data rover0 general objective6 high_res waypoint0 waypoint3)
   added: (communicated_image_data objective6 high_res)
   goals met: 12 of 13
17. (navigate rover0 waypoint0 waypoint3)
   deleted: (at rover0 waypoint0)
   added: (at rover0 waypoint3)
   goals met: 12 of 13
18. (take_image rover0 waypoint3 objective2 camera6 low_res)
   deleted: (calibrated camera6 rover0)
   added: (have_image rover0 objective2 low_res)
   goals met: 12 of 13
19. (navigate rover0 waypoint3 waypoint7)
   deleted: (at rover0 waypoint3)
   added: (at rover0 waypoint7)
   goals met: 12 of 13
20. (communicate_image_data rover0 general objective2 low_res waypoint7 waypoint3)
   added: (communicated_image_data objective2 low_res)
   goals met: 13 of 13
